Public Member Functions | Static Public Member Functions | List of all members
ACAPI::MEP::v1::RoutingElement Class Reference
MEP Element Manager
The RoutingElement can contain Routing Segments and Routing Nodes. More...
#include <MEPRoutingElement.hpp>
 Inheritance diagram for ACAPI::MEP::v1::RoutingElement:
 Public Member Functions
std::vector< UniqueID >  | GetRoutingSegmentIds () const
std::vector< UniqueID >  | GetRoutingNodeIds () const
std::vector< API_Coord3D >  | GetPolyLine () const
double  | GetOffsetFromHomeStory () const
Domain  | GetDomain () const
 API_AttributeIndex  | GetMEPSystem () const
Returns the AttributeIndex of the MEPSystem attribute to which it belongs.
RoutingElementDefault  | PickUpDefault () const
Picks up and returns the Default of the RoutingElement.
RoutingSegmentDefault  | GetRoutingSegmentDefaultParameters () const
RoutingNodeDefault  | GetRoutingNodeDefaultParameters () const
template<typename ModifierFunc >
Result< void >  | Modify (const ModifierFunc &modifierFunc, const GS::UniString &undoString)
Executes the passed modifier scope in an Undoable command.
Result< void >  | Inject (const RoutingElementDefault &routingElementDefault)
Injects the given Default settings to the RoutingElement.
void  | SetMEPSystem (const API_AttributeIndex &index)
Sets the MEPSystem attribute of the RoutingElement.
Result< void >  | SetRoutingSegmentDefaultParameters (const RoutingSegmentDefault &routingSegmentDefault)
Sets the parameters of the uncustomized RoutingSegments.
Result< void >  | SetRoutingNodeDefaultParameters (const RoutingNodeDefault &routingNodeDefault)
Sets the parameters of the uncustomized RoutingNodes.
Result< void >  | Connect (const UniqueID &uniqueId)
Connects this route with the parameter MEPElement or RoutingElement, if they can be connected.
 Static Public Member Functions
static Result< RoutingElement >  | Get (const UniqueID &uniqueId)
Returns a Routing Element.
Detailed Description
The RoutingElement can contain Routing Segments and Routing Nodes.
RoutingElement is on the highest level of the hierarchy.
Since
Archicad 27
Example code snippet from Test / New MEP
Getters
 ACAPI::Result<RoutingElement> routingElement = RoutingElement::Get (id);
 if (routingElement.IsErr ()) {
 ACAPI_WriteReport (routingElement.UnwrapErr ().text.c_str (), false);
 return;
 }
 Reporter routingElementReporter;
 std::vector<API_Coord3D> polyLine = routingElement->GetPolyLine ();
 routingElementReporter.Add ("Polyline of the routing element:");
 routingElementReporter.SetTabCount (1);
 for (const API_Coord3D& node : polyLine)
 routingElementReporter.Add (node);
 routingElementReporter.SetTabCount (0);
 routingElementReporter.Add ("Offset from Home Story", routingElement->GetOffsetFromHomeStory ());
 if (routingElement->GetMEPSystem () == APIInvalidAttributeIndex) {
 routingElementReporter.Add ("MEP System", GS::UniString { "Undefined" });
 } else {
 API_Attribute attribute = {};
 attribute.header.typeID = API_MEPSystemID;
 attribute.header.index = routingElement->GetMEPSystem ();
 const GSErrCode err = ACAPI_Attribute_Get (&attribute);
 if DBVERIFY (err == NoError)
 routingElementReporter.Add ("MEP System", GS::UniString { attribute.header.name });
 }
 // Write informations about placed Routing Segments
 std::vector<UniqueID> segmentIds = routingElement->GetRoutingSegmentIds ();
 ACAPI_WriteReport ("List of Routing Segments:\n", false);
 for (const UniqueID& id : segmentIds)
 WriteRoutingSegmentDetails (id);
 // Write informations about placed Routing Nodes
 std::vector<UniqueID> nodeIds = routingElement->GetRoutingNodeIds ();
 ACAPI_WriteReport ("List of Routing Nodes:\n", false);
 for (const UniqueID& id : nodeIds)
 WriteRoutingNodeDetails (id);
 Modification
 ACAPI::Result<RoutingElement> routingElement = RoutingElement::Get (id);
 if (routingElement.IsErr ()) {
 ACAPI_WriteReport (routingElement.UnwrapErr ().text.c_str (), false);
 return routingElement.UnwrapErr ().kind;
 }
 ERRCHK_NO_ASSERT (ModifyRoutingMEPSystem (*routingElement));
 std::vector<UniqueID> routingNodeIds = routingElement->GetRoutingNodeIds ();
 std::vector<UniqueID> routingSegmentIds = routingElement->GetRoutingSegmentIds ();
 ACAPI::Result<RoutingNode> node = RoutingNode::Get (routingNodeIds[4]);
 if (node.IsErr ())
 return node.UnwrapErr ().kind;
 ERRCHK_NO_ASSERT (ModifyRoutingNode (*node));
 ACAPI::Result<RoutingSegment> segment = RoutingSegment::Get (routingSegmentIds[4]);
 if (segment.IsErr ())
 return segment.UnwrapErr ().kind;
 ERRCHK_NO_ASSERT (ModifyRoutingSegment (*segment));
 ERRCHK_NO_ASSERT (ModifyDefaultRoutingNode (*routingElement));
 ERRCHK_NO_ASSERT (ModifyDefaultRoutingSegment (*routingElement));
 return NoError;
 Connection of two routes
ACAPI::Result<void> ConnectRoutes (const std::vector<UniqueID>& routeIds)
{
 if (routeIds.empty ())
 return { ACAPI::Error (ErrParam, "Route vector is empty."), ACAPI_GetToken () };
 ACAPI::Result<RoutingElement> routingElem = RoutingElement::Get (routeIds[0]);
 if (routingElem.IsErr ())
 return { routingElem.UnwrapErr (), ACAPI_GetToken () };
 for (size_t i = 1; i < routeIds.size (); ++i) {
 ACAPI::Result<void> modifyResult = routingElem->Modify ([&](RoutingElement::Modifier& modifier) -> GSErrCode {
 ACAPI::Result<void> connectionResult = modifier.Connect (routeIds[i]);
 if (connectionResult.IsErr ())
 return connectionResult.UnwrapErr ().kind;
 return NoError;
 }, "Connect routes.");
 if (modifyResult.IsErr ())
 return { modifyResult.UnwrapErr (), ACAPI_GetToken () };
 }
 return ACAPI::Ok ();
}
 Placement and Connection wrapped together
 ACAPI::Result<void> commandResult = ACAPI::CallUndoableCommand ([&]() -> GSErrCode {
 ACAPI::Result<std::vector<UniqueID>> routeIds = PlaceRoutes (placementData, domain);
 if (routeIds.IsErr ())
 return routeIds.UnwrapErr ().kind;
 ACAPI::Result<void> connectionResult = ConnectRoutes (*routeIds);
 if (connectionResult.IsErr ())
 return connectionResult.UnwrapErr ().kind;
 return NoError;
 }, ACAPI_GetToken (), "Place and connect routes.");
 Connection of route with element
 ACAPI::Result<FlexibleSegment> flexibleSegment = FlexibleSegment::Get (*flexibleSegmentId);
 if (flexibleSegment.IsErr ())
 return flexibleSegment.UnwrapErr ().kind;
 ACAPI::Result<Port> flexibleSegmentPort = Port::Get (flexibleSegment->GetPortIDs ()[0]);
 if (flexibleSegmentPort.IsErr ())
 return flexibleSegmentPort.UnwrapErr ().kind;
 flexibleSegmentPort->Modify ([&](Port::Modifier& modifier) {
 modifier.SetShape (ConnectorShape::Circular);
 modifier.SetWidth (0.35);
 ACAPI::Result<Port> flexibleSegmentPort2 = Port::Get (flexibleSegment->GetPortIDs ()[1]);
 flexibleSegmentPort2->Modify ([&](Port::Modifier& modifier) {
 modifier.SetShape (ConnectorShape::Circular);
 modifier.SetWidth (0.35);
 }, "Set FlexibleSegment Port2 size.");
 }, "Set FlexibleSegment Port size.");
 std::vector<API_Coord3D> referenceCoords;
 referenceCoords.push_back ({ 5.0, -10.0, 0.0 });
 referenceCoords.push_back ({ 8.0, -10.0, 0.0 });
 referenceCoords.push_back ({ 8.0, -10.0, 10.0 });
 std::vector<RoutingSegmentCrossSectionData> crossSectionData;
 crossSectionData.push_back ({ 0.3, 0.5, ConnectorShape::Rectangular });
 crossSectionData.push_back ({ 0.8, 0.5, ConnectorShape::Rectangular });
 ACAPI::Result<std::vector<UniqueID>> routingElementId = PlaceRoutes ({ { referenceCoords, crossSectionData } }, Domain::Ventilation);
 if (routingElementId.IsErr ())
 return routingElementId.UnwrapErr ().kind;
 ACAPI::Result<RoutingElement> routingElement = RoutingElement::Get ((*routingElementId)[0]);
 if (routingElement.IsErr ())
 return routingElement.UnwrapErr ().kind;
 routingElement->Modify ([&](RoutingElement::Modifier& modifier) {
 modifier.Connect (*flexibleSegmentId);
 }, "Connect RoutingElement to FlexibleSegment.");
Member Function Documentation
◆ Connect()
 Result< void > ACAPI::MEP::v1::RoutingElement::Connect  |  ( |  const UniqueID &  |  uniqueId | )
Connects this route with the parameter MEPElement or RoutingElement, if they can be connected.
In case of routes, the two of them have to match in domain, MEPSystem and they need to have an intersection point which will serve as a connection. Depending on geometry this could mean the merger of two routes (when one is a continuation of the other), or insertion of a Branch element (when three routes meet, or one is connected into another's RoutingSegment). In case of elements, their connecting ports have to match in domain, MEPSystem and have to be positioned and oriented correctly. The direction vector of the ports have to point in opposite directions.
Parameters
uniqueId | The UniqueID of the MEPElement or RoutingElement which will be connected to this route.
Returns
Returns an error in case of domain, MEPSystem mismatch or if they can not be connected by geometry, otherwise nothing.
◆ Get()
 static Result< RoutingElement > ACAPI::MEP::v1::RoutingElement::Get  |  ( |  const UniqueID &  |  uniqueId | )
static
Returns a Routing Element.
Parameters
uniqueId | The UniqueID of the requested Routing Element.
Returns
If the uniqueId belongs to a RoutingElement, returns the object associated to it, otherwise Error.
◆ GetDomain()
 Domain ACAPI::MEP::v1::RoutingElement::GetDomain  |  ( |   | ) |   const
Returns
Returns the domain of the RoutingElement.
◆ GetOffsetFromHomeStory()
 double ACAPI::MEP::v1::RoutingElement::GetOffsetFromHomeStory  |  ( |   | ) |   const
Returns
Returns the relative offset level from the lowest node of the RoutingElement to the level of Home Story.
◆ GetPolyLine()
 std::vector< API_Coord3D > ACAPI::MEP::v1::RoutingElement::GetPolyLine  |  ( |   | ) |   const
Returns
Returns the list of 3D coordinates which form the polyline of the RoutingElement.
◆ GetRoutingNodeDefaultParameters()
 RoutingNodeDefault ACAPI::MEP::v1::RoutingElement::GetRoutingNodeDefaultParameters  |  ( |   | ) |   const
On Archicad's user interface, in the editing mode of a RoutingElement, its RoutingNodes can be customized separately. This function provides the opportunity for querying the uncustomized RoutingNode settings from the RoutingElement.
Returns
Returns the parameters of the uncustomized RoutingNodes.
◆ GetRoutingNodeIds()
 std::vector< UniqueID > ACAPI::MEP::v1::RoutingElement::GetRoutingNodeIds  |  ( |   | ) |   const
Returns
Returns the UniqueIDs of the Routing Nodes contained by the RoutingElement.
◆ GetRoutingSegmentDefaultParameters()
 RoutingSegmentDefault ACAPI::MEP::v1::RoutingElement::GetRoutingSegmentDefaultParameters  |  ( |   | ) |   const
On Archicad's user interface, in the editing mode of a RoutingElement, its RoutingSegments can be customized separately. This function provides the opportunity for querying the uncustomized RoutingSegment settings from the RoutingElement.
Returns
Returns the parameters of the uncustomized RoutingSegments.
◆ GetRoutingSegmentIds()
 std::vector< UniqueID > ACAPI::MEP::v1::RoutingElement::GetRoutingSegmentIds  |  ( |   | ) |   const
Returns
Returns the UniqueIDs of the Routing Segments contained by the RoutingElement.
◆ Inject()
 Result< void > ACAPI::MEP::v1::RoutingElement::Inject  |  ( |  const RoutingElementDefault &  |  routingElementDefault | )
Injects the given Default settings to the RoutingElement.
Parameters
routingElementDefault | The Default which will be injected. One should pay attention to the parameter, it has to belong to the same domain than the object it is called for.
Returns
Returns an error if the injection fails for some reason, otherwise nothing.
◆ Modify()
 template<typename ModifierFunc >
 Result< void > ACAPI::MEP::v1::RoutingElement::Modify  |  ( |  const ModifierFunc &  |  modifierFunc,
|  const GS::UniString &  |  undoString
)
Executes the passed modifier scope in an Undoable command.
Parameters
modifierFunc | The modifier scope (lambda, std::function or function pointer) the caller wants to execute.
undoString | The text which appears in the undo queue of Archicad after executing the command.
Returns
Returns an error if the process of modification fails for some reason, otherwise nothing.
◆ PickUpDefault()
 RoutingElementDefault ACAPI::MEP::v1::RoutingElement::PickUpDefault  |  ( |   | ) |   const
Picks up and returns the Default of the RoutingElement.
Returns
Returns a BendDefault with the parameters of the object it was called for.
◆ SetMEPSystem()
 void ACAPI::MEP::v1::RoutingElement::SetMEPSystem  |  ( |  const API_AttributeIndex &  |  index | )
Sets the MEPSystem attribute of the RoutingElement.
Parameters
index | The AttributeIndex of the MEPSystem attribute.
◆ SetRoutingNodeDefaultParameters()
 Result< void > ACAPI::MEP::v1::RoutingElement::SetRoutingNodeDefaultParameters  |  ( |  const RoutingNodeDefault &  |  routingNodeDefault | )
Sets the parameters of the uncustomized RoutingNodes.
On Archicad's user interface, in the editing mode of a RoutingElement, its RoutingNodes can be customized separately. This function provides the opportunity for setting the uncustomized RoutingNode parameters in the RoutingElement.
Parameters
routingNodeDefault | The Default to be set. One should pay attention to the parameter, it has to belong to the same domain than the object it is called for.
Returns
Returns an error in case of domain mismatch or if the set operation fails for some internal reason, otherwise nothing.
◆ SetRoutingSegmentDefaultParameters()
 Result< void > ACAPI::MEP::v1::RoutingElement::SetRoutingSegmentDefaultParameters  |  ( |  const RoutingSegmentDefault &  |  routingSegmentDefault | )
Sets the parameters of the uncustomized RoutingSegments.
On Archicad's user interface, in the editing mode of a RoutingElement, its RoutingSegments can be customized separately. This function provides the opportunity for setting the uncustomized RoutingSegment parameters in the RoutingElement.
Parameters
routingSegmentDefault | The Default to be set. One should pay attention to the parameter, it has to belong to the same domain than the object it is called for.
Returns
Returns an error in case of domain mismatch or if the set operation fails for some internal reason, otherwise nothing.